package Business;

public class HomePage {
}

// Business layer (в папке src -> main -> test -> java)
// здесь находится вся логика приложения, Page Object, классы с данными, степы
// Page object - классы, которые соответствуют каждой тестируемой странице приложения
// внутри элементы - поля класса и методы - что с этими элементами делаем.
// Используем как css, так и xpath локаторы.
// Все действия с элементами должны быть залогированы. Т.е. должен быть лог, в котором понятно описано действие.
